{
  "main": {
    "name": "Simon Harris",
    "subTitle": "Software Developer & Solution Architect",
    "description": "Senior Software Engineer with 12+ years of hands-on experience building and architecting scalable enterprise solutions. I specialize in cloud transformation and distributed systems, with particular expertise in API development and microservice architectures. My approach combines deep technical knowledge with practical problem-solving, consistently delivering robust solutions that drive business value. I maintain an active interest in emerging technologies, particularly in AI-enhanced development workflows, which I've successfully implemented to improve delivery efficiency and code quality.",
    "image": "simon-harris.png",
    "bio": "Drawing on over a decade of software engineering experience, I specialize in building cloud-native solutions using .NET technologies and Azure Cloud Services. My experience spans healthcare, maritime insurance, and scientific computing, where I've architected monolith and microservice-based systems that balance technical excellence with practical business needs. I'm passionate about clean code and system design, having led teams in modernizing legacy applications and implementing cloud-first architectures. What drives me is finding elegant solutions to complex technical challenges while ensuring maintainable, high-quality code.",
    "contactMessage": "Interested in discussing a project or exploring potential collaborations? I'd be delighted to connect with you.",
    "email": "simon@alphamind.tech",
    "phone": "+447982189054",
    "address": {
      "street": "35 Rowley Lane",
      "city": "Derby",
      "state": "Derbyshire",
      "zip": "DE23 1FT"
    },
    "website": "https://www.alphamind.tech",
    "resumeDownload": "SimonHarris.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/simon-harris-9a5b1159/",
        "className": "fa fa-linkedin"
      }
    ]
  },
  "resume": {
    "skillMessage": "My technical expertise covers a wide range of technologies and methodologies:",
    "education": [
      {
        "school": "Staffordshire University",
        "degree": "BSc (Hons) International Computer Games Programming",
        "graduated": "May 2012",
        "description": "Gained a strong foundation in software development principles, algorithms, and graphics programming. Developed proficiency in C++, Java, and game engine development. The course also included modules on .NET Framework and C#, providing early exposure to Microsoft technologies. Completed projects using C# and XNA Framework, which enhanced my understanding of game development within the .NET ecosystem."
      },
      {
        "school": "Cisco Networking Academy",
        "degree": "CCNA 1, CCNA 2, CCNA 3",
        "graduated": "2008",
        "description": "Completed Cisco certifications, gaining valuable knowledge in networking principles and infrastructure, which has proven beneficial in developing distributed systems and cloud-based applications using .NET technologies."
      },
      {
        "school": "OCR",
        "degree": "Level 3 Certificate for IT Professionals",
        "graduated": "2008",
        "description": "Obtained certification covering various IT aspects, including hardware/equipment installation and customer support. This foundation has been instrumental in understanding system architecture and developing user-centric applications."
      }
    ],
    "work": [
      {
        "company": "NorthStandard",
        "title": "Senior Software Engineer (contract)",
        "years": "February 2022 - Present",
        "description": "Leading enterprise-scale digital transformation initiatives for maritime insurance, managing systems handling 500+ concurrent users. Architected cloud-native solutions transitioning critical systems to Azure Cloud Services, implemented modern authentication, and established loosely coupled service-oriented architecture. Key projects include modernizing document management systems, migrating legacy applications to .NET 8, and developing sophisticated claims management platforms."
      },
      {
        "company": "Deloitte",
        "title": "API Developer (contract)",
        "years": "October 2021 - February 2022",
        "description": "Developed complex insurance system APIs for Lloyds of London, enabling real-time document digitization and contract distribution. Architected microservice solutions using containerized Docker instances and MongoDB Atlas, maintaining 80%+ test coverage while implementing comprehensive API documentation and security measures."
      },
      {
        "company": "Ashfield Healthcare",
        "title": "Software Development Manager / Software Developer",
        "years": "March 2015 - September 2021",
        "description": "Led the development of global ATS and HCM systems. Managed the delivery of a critical order management system for a major vaccine supplier. Spearheaded an omnichannel capability initiative using Angular and .NET Core. Mentored developers and fostered a culture of technical excellence."
      },
      {
        "company": "3tc Software",
        "title": "Software Developer",
        "years": "October 2012 - February 2015",
        "description": "Developed software packages for emergency services and local authorities, including CAD systems and statistical analysis tools. Created a custom routing engine for emergency response optimization using advanced path finding algorithms and data structures."
      },
      {
        "company": "CERN",
        "title": "Software Developer",
        "years": "June 2010 - July 2011",
        "description": "Developed visualization software for the Compact Muon Solenoid (CMS) experiment. Worked with C++, Python, and OpenGL in a high-performance computing environment, adhering to strict coding standards and peer review processes."
      }
    ],
    "skills": [
      {
        "name": "C# / .NET 8",
        "level": "95%"
      },
      {
        "name": "Azure Cloud Services",
        "level": "90%"
      },
      {
        "name": "Microservices Architecture",
        "level": "85%"
      },
      {
        "name": "Angular / TypeScript",
        "level": "85%"
      },
      {
        "name": "DevOps / CI/CD",
        "level": "80%"
      },
      {
        "name": "Docker / Terraform",
        "level": "75%"
      },
      {
        "name": "SQL Server / MongoDB",
        "level": "75%"
      },
      {
        "name": "SharePoint Online / Graph API",
        "level": "70%"
      }
    ],
    "coreCompetencies": [
      "Software Engineering: Full-stack development, API design, test-driven development",
      "Enterprise Solution Architecture: Cloud transformation strategies, system modernization, microservices design",
      "Technical Leadership: Stakeholder management, cross-functional team leadership, architectural governance",
      "Cloud & DevOps: Azure Cloud Services, CI/CD implementation, infrastructure automation",
      "Innovation: AI-enhanced development workflows, emerging technology adoption, digital transformation"
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "",
        "category": "",
        "image": "",
        "url": ""
      },
      {
        "title": "",
        "category": "",
        "image": "",
        "url": ""
      },
      {
        "title": "",
        "category": "",
        "image": "",
        "url": ""
      },
      {
        "title": "",
        "category": "",
        "image": "",
        "url": ""
      },
      {
        "title": "",
        "category": "",
        "image": "",
        "url": ""
      },
      {
        "title": "",
        "category": "",
        "image": "",
        "url": ""
      }
    ]
  }
}